## Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## Import customer dataset from the original data folder

In [2]:
path=r"C:\Users\tjsra\OneDrive\Desktop\INSTACART BASKET ANALYSIS"

In [3]:
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

### check the dimensions of the dataframe

In [4]:
customers.shape

(206209, 10)

In [5]:
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

### check the data types

In [6]:
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## Wrangling the Data

### Rename the columns to establish uniformity

In [7]:
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [8]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [9]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [10]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [11]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [12]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

### Check the columns whether they have been successfully renamed or not.

In [13]:
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [14]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### I think there is no need to drop any column.

## Complete the fundamental data quality and consistency checks.

### Addressing Mix data type in the dataframe

In [15]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

### first_name has mixed type data so we have to address it and the user_id column is not containing mixed type data but still improperly listed as an integer so a change is needed for it as well.

In [16]:
customers['first_name'] = customers['first_name'].astype('str')

In [17]:
customers['user_id'] = customers['user_id'].astype('str')

### Recheck the data types

In [18]:
customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

### Check for missing data

In [19]:
customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

### Check for Duplicates

In [20]:
customers_dups = customers[customers.duplicated()]

In [21]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

### Perform descriptive statistics

In [22]:
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

### There is no missing values and Duplicates in the dataframe and nothing unusual present in the descriptive statistics.

## combine the customer data with the rest of your prepared instacart data

### Import the prepared data set

In [23]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged_grouped.pkl'))

### check the newly imported dataframe.

In [24]:
ords_prods_merge.shape

(9918253, 25)

In [25]:
ords_prods_merge.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_product_price,spending_flag,median_days_between_orders,order_frequency
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

### Check the customers dataframe

In [26]:
customers.shape

(206209, 10)

In [27]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

###  both dataframes share the user_id column so lets check datatype of shared column

In [29]:
ords_prods_merge.dtypes['user_id']

dtype('int64')

In [31]:
customers.dtypes['user_id']

dtype('O')

### Make sure both key columns are the same data type

In [32]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [33]:
ords_prods_merge.dtypes['user_id']

dtype('O')

### Now Merge the two dataframes using the column 'user_id' as the shared column with the default join-(inner)

In [36]:
custs_ords_prods = ords_prods_merge.merge(customers, on = 'user_id',indicator = 'merge_indicator')

In [38]:
custs_ords_prods.shape

(9918253, 35)

In [37]:
custs_ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,merge_indicator
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

### check the inner join value counts

In [39]:
custs_ords_prods['_merge'].value_counts()

_merge
both          9918253
left_only           0
right_only          0
Name: count, dtype: int64

### lets check the data types

In [40]:
custs_ords_prods.dtypes

product_id                       int64
product_name                    object
aisle_id                         int64
department_id                    int64
prices                         float64
order_id                         int64
user_id                         object
order_number                     int64
order_day_of_week                int64
order_hour_of_day                int64
days_since_last_order          float64
first_order                       bool
add_to_cart_order                int64
reordered                        int64
_merge                        category
price_range_loc                 object
busiest_day                     object
busiest_days                    object
busiest_period_of_day           object
max_order                        int64
loyalty_flag                    object
mean_product_price             float64
spending_flag                   object
median_days_between_orders     float64
order_frequency                 object
first_name                      object
surname                         object
gender                          object
state                           object
age                              int64
date_joined                     object
n_dependants                     int64
marital_status                  object
income                           int64
merge_indicator               category
dtype: object

### lets fix  the 'order_id' column data type

In [41]:
custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

In [42]:
custs_ords_prods.dtypes

product_id                       int64
product_name                    object
aisle_id                         int64
department_id                    int64
prices                         float64
order_id                        object
user_id                         object
order_number                     int64
order_day_of_week                int64
order_hour_of_day                int64
days_since_last_order          float64
first_order                       bool
add_to_cart_order                int64
reordered                        int64
_merge                        category
price_range_loc                 object
busiest_day                     object
busiest_days                    object
busiest_period_of_day           object
max_order                        int64
loyalty_flag                    object
mean_product_price             float64
spending_flag                   object
median_days_between_orders     float64
order_frequency                 object
first_name                      object
surname                         object
gender                          object
state                           object
age                              int64
date_joined                     object
n_dependants                     int64
marital_status                  object
income                           int64
merge_indicator               category
dtype: object

## Export this dataframe into pickle format

In [44]:
custs_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))